{
  "backend/main.mo": "Motoko canister defining access control, school and user profile storage, and daily report management with role-based authorization.",
  "feature_evidence.json": "JSON report listing implemented features, associated files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Text file providing brief summaries of key frontend components for fast reference during build planning.",
  "frontend/index.css": "Tailwind CSS configuration defining design tokens, color variables, and base styles for light and dark themes.",
  "frontend/index.html": "Base HTML entry point that loads the React app and sets metadata and app icon.",
  "frontend/src/App.tsx": "Main React app handling authentication, role-based routing, and admin view switching.",
  "frontend/src/components/admin/ActiveSchoolsSection.tsx": "Displays a searchable table of active schools with loading/error states and opens an edit dialog for selected schools.",
  "frontend/src/components/admin/AdminSummaryCards.tsx": "Shows summary cards for total active schools and number of reports submitted for a selected date.",
  "frontend/src/components/admin/AnalyticsSection.tsx": "Generates trend and completion analytics from daily reports and renders charts with loading fallbacks.",
  "frontend/src/components/admin/DailyProgressIndicators.tsx": "Displays completion badges for various report categories based on submitted scores and attached data.",
  "frontend/src/components/admin/EditSchoolDialog.tsx": "Modal form allowing admins to edit a school’s details and update them through a mutation.",
  "frontend/src/components/admin/KepsekProfileForm.tsx": "Form for registering a principal with a school profile, validating input and saving via mutation.",
  "frontend/src/components/admin/MonitoringTable.tsx": "Displays a sortable daily monitoring table for admins, showing school status, progress, and report details with loading skeletons and detail modal support.",
  "frontend/src/components/admin/ReportDetailView.tsx": "Shows a dialog with full report details including attendance photo, times, scores, and school info for a selected monitoring row.",
  "frontend/src/components/AppHeader.tsx": "Header component with branding and logout handling that clears identity and query cache.",
  "frontend/src/components/kepsek/AttendancePhotoField.tsx": "Handles selecting, validating, previewing, and uploading an attendance photo with progress tracking.",
  "frontend/src/components/kepsek/DailyReportForm.tsx": "Form for principals to submit or edit daily reports including photo, times, task completion, and score calculation.",
  "frontend/src/components/kepsek/ProfileSetupDialog.tsx": "Dialog for principals to set up school profile information and save it through an API call.",
  "frontend/src/components/kepsek/TodaySubmissionSummary.tsx": "Displays a summary of today’s submitted report with scores, photo, and an option to edit.",
  "frontend/src/components/StatusPills.tsx": "Reusable badges for displaying scores, submission status, and category completion with color-coded variants.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout helpers, and initializes AuthClient with stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for roles, school data, daily reports, and mutations tied to the authenticated actor.",
  "frontend/src/index.css": "Tailwind CSS setup with light/dark theme variables and global styling rules.",
  "frontend/src/lib/utils.ts": "Exports a utility for merging Tailwind class names using clsx and twMerge.",
  "frontend/src/localization/dashboardId.ts": "Contains Indonesian localization strings for admin and principal dashboards.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AccessDeniedPage.tsx": "UI page shown when access is denied, offering logout, principal ID copy, and retrying role checks.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with date selection, summary cards, analytics, active schools, and monitoring table.",
  "frontend/src/pages/AdminKepsekManagementPage.tsx": "Provides UI for admins to register and manage school principal profiles, including a form toggle and guidance alert.",
  "frontend/src/pages/KepsekDashboardPage.tsx": "Displays the Kepsek dashboard with school/profile loading states, today’s report status, and daily reporting form logic.",
  "frontend/src/pages/LoginPage.tsx": "Shows a login screen using Internet Identity with branding and a sign‑in button.",
  "frontend/src/utils/candidOption.ts": "Utility functions to unwrap Candid optional values and handle optional ExternalBlob URLs safely.",
  "frontend/src/utils/dayKey.ts": "Provides helpers to normalize dates to nanosecond day keys for daily report storage.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, layout settings, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata describing features, issues, and a pending request to auto‑assign the Kepsek role during school profile updates."
}