{
  "backend/main.mo": "Motoko canister implementing access control, school profiles, user profiles, and per‑day daily reports with storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence listing affected files, components, and requirements for daily report editing, per‑day data rules, and admin sync behavior.",
  "frontend-file-summaries.txt": "JSON map summarizing key frontend files including dashboards, components, hooks, and behaviors related to daily report flow and admin views.",
  "frontend/index.css": "Tailwind CSS setup defining base layers and extensive light/dark theme CSS variables for UI colors.",
  "frontend/index.html": "HTML entry point loading the React app and setting metadata and favicon.",
  "frontend/src/App.tsx": "Main app component handling authentication, role routing, and admin view switching with loading and access‑denied handling.",
  "frontend/src/components/admin/ActiveSchoolsSection.tsx": "Displays active schools with search, filtering, loading/error states, and an edit dialog trigger.",
  "frontend/src/components/admin/AdminSummaryCards.tsx": "Shows summary cards for active school count and daily report submissions with loading placeholders.",
  "frontend/src/components/admin/AnalyticsSection.tsx": "Renders trend and completion analytics charts using daily reports, with loading skeletons and computed metrics.",
  "frontend/src/components/admin/DailyProgressIndicators.tsx": "Shows completion badges for report categories based on submitted scores and optional photo data.",
  "frontend/src/components/admin/EditSchoolDialog.tsx": "Modal form for editing a school’s profile and saving updates via mutation with validation and toasts.",
  "frontend/src/components/admin/KepsekProfileForm.tsx": "Form for registering a principal’s school profile, validating inputs and submitting via mutation.",
  "frontend/src/components/admin/MonitoringTable.tsx": "Displays daily monitoring rows, sorts them by report status and score, and allows viewing detailed reports via a modal.",
  "frontend/src/components/admin/ReportDetailView.tsx": "Shows detailed information for a daily report, including photos, timestamps, category scores, and notes in a dialog.",
  "frontend/src/components/AppHeader.tsx": "Header component with branding, logout logic that clears queries, and optional child controls.",
  "frontend/src/components/kepsek/AttendancePhotoField.tsx": "Handles image upload for attendance photos with validation, previews, and upload progress tracking.",
  "frontend/src/components/kepsek/DailyReportForm.tsx": "Form for creating or editing a daily report, managing photo, time fields, checkboxes, notes, and saving to backend.",
  "frontend/src/components/kepsek/ProfileSetupDialog.tsx": "Dialog for initial school profile setup, collecting school name, region, and principal name before saving.",
  "frontend/src/components/kepsek/TodaySubmissionSummary.tsx": "Displays a submitted daily report summary including photo, times, notes, and score details with an edit option.",
  "frontend/src/components/StatusPills.tsx": "Reusable badge components for displaying scores, submission state, and category score indicators with color coding.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, stored identities, and auth client configuration.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls in React Query hooks for roles, schools, reports, and related mutations, scoped to the authenticated actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes with a blue‑green palette.",
  "frontend/src/lib/utils.ts": "Utility to merge class names using clsx and tailwind-merge.",
  "frontend/src/localization/dashboardId.ts": "Centralized Indonesian UI text for admin and principal dashboards, including labels, messages, and section titles.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Renders an access denied screen with principal ID display, copy action, logout, and retry role-check functionality.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with date selection, report download, summary cards, analytics, active schools, and monitoring table.",
  "frontend/src/pages/AdminKepsekManagementPage.tsx": "Provides UI for managing and registering school principal profiles, including a form toggle and instructions.",
  "frontend/src/pages/KepsekDashboardPage.tsx": "Displays the Kepsek dashboard with school profile loading, daily report viewing/editing, date selection, and missing-profile handling.",
  "frontend/src/pages/LoginPage.tsx": "Shows the login screen with Internet Identity authentication and basic branding.",
  "frontend/src/utils/candidOption.ts": "Utility functions for unwrapping Candid optional values and handling optional ExternalBlob fields.",
  "frontend/src/utils/dayKey.ts": "Provides timezone-safe utilities for generating day keys and parsing/formatting date input values.",
  "frontend/src/utils/reportDownload.ts": "Generates and downloads admin monitoring data as a CSV file with formatting helpers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, including daily report requirements, known bugs, and feature requests for the School Daily Reports system."
}