{
  "backend/main.mo": "Actor implements authorization, school and user profile storage, and daily report management with scoring and access control.",
  "feature_evidence.json": "Contains feature evidence entries listing related frontend files, components, and test IDs for three tracked features.",
  "frontend-file-summaries.txt": "A mapping of frontend file paths to short functional descriptions used for build planning.",
  "frontend/index.css": "Tailwind CSS base setup defining light and dark theme CSS variables and applying global styles.",
  "frontend/index.html": "HTML entry point loading the React app with root container and main script.",
  "frontend/src/App.tsx": "Main React component handling authentication, role-based routing, and admin view switching.",
  "frontend/src/components/admin/ActiveSchoolsSection.tsx": "Displays searchable, filterable list of active schools with loading/error states and an edit dialog trigger.",
  "frontend/src/components/admin/AdminSummaryCards.tsx": "Shows summary cards for active school count and daily report submissions with loading skeletons.",
  "frontend/src/components/admin/AnalyticsSection.tsx": "Generates charts for daily report trends and completion percentages using fetched report data.",
  "frontend/src/components/admin/DailyProgressIndicators.tsx": "Renders badges showing completion status of daily report categories with safe checks for scores and photos.",
  "frontend/src/components/admin/EditSchoolDialog.tsx": "Provides a modal form for editing a school’s details and submitting updates to the backend.",
  "frontend/src/components/admin/KepsekProfileForm.tsx": "Form for registering a new school profile for a principal, including validation and save operation.",
  "frontend/src/components/admin/MonitoringTable.tsx": "Displays sorted principal daily reports with scores, status, and detail view access for a selected date.",
  "frontend/src/components/admin/ReportDetailView.tsx": "Shows detailed daily report info including photo, times, and score breakdown in a dialog.",
  "frontend/src/components/AppHeader.tsx": "Reusable app header with logo, title, logout handling, and optional child elements.",
  "frontend/src/components/kepsek/AttendancePhotoField.tsx": "Handles image selection, validation, preview, and upload progress for attendance photos.",
  "frontend/src/components/kepsek/DailyReportForm.tsx": "Form for principals to submit daily reports with times, photo, task completion, and automatic scoring.",
  "frontend/src/components/kepsek/ProfileSetupDialog.tsx": "Form dialog for setting up school profile details such as name, region, and principal.",
  "frontend/src/components/kepsek/TodaySubmissionSummary.tsx": "Displays today's submitted report with photo, score breakdown, and an edit option.",
  "frontend/src/components/StatusPills.tsx": "UI badge components for score display, submission status, and category score indicators.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, stored identity loading, and auth-client configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating role, school, and daily report data using the authenticated actor.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and theme variables for light and dark mode styling.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge Tailwind and conditional class names.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Displays an access denied message with a logout button that clears identity and cached queries.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard showing summaries, charts, active schools, and monitoring table with date selection.",
  "frontend/src/pages/AdminKepsekManagementPage.tsx": "Admin page for registering and managing school principal profiles, including a form toggle and guidance alert.",
  "frontend/src/pages/KepsekDashboardPage.tsx": "React page that loads the principal’s school and today’s report, handles errors, and shows either the daily form or a summary depending on submission state.",
  "frontend/src/pages/LoginPage.tsx": "Login screen that authenticates users via Internet Identity and displays a styled sign‑in card.",
  "frontend/src/utils/dayKey.ts": "Provides helpers to normalize dates to start‑of‑day nanosecond keys for daily report storage.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, container settings, extended animations, and plugins.",
  "project_state.json": "Project metadata summarizing app purpose, architecture notes, known issues, and implemented feature records."
}