{
  "backend/main.mo": "Motoko canister managing schools and daily reports with admin authorization, data storage, and role-gated CRUD operations.",
  "feature_evidence.json": "Lists features, related frontend files, components, and test IDs for admin school editing and React Query updates.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files for quick reference during build planning.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, and mounting the React app.",
  "frontend/src/App.tsx": "Main app router handling authentication, role-based page selection, and admin view switching.",
  "frontend/src/components/admin/ActiveSchoolsSection.tsx": "Admin table listing active schools with search, error/loading states, and edit dialog integration.",
  "frontend/src/components/admin/AdminSummaryCards.tsx": "Displays two summary cards showing active school count and today's report submissions using query hooks and loading skeletons.",
  "frontend/src/components/admin/AnalyticsSection.tsx": "Generates completion percentages and 7‑day trend data from today's reports and renders line and pie charts, with skeletons during loading.",
  "frontend/src/components/admin/EditSchoolDialog.tsx": "Dialog form for editing a school's details, prefilled from a summary object and saved via a mutation hook with validation and toasts.",
  "frontend/src/components/admin/KepsekProfileForm.tsx": "Form for principals to create or update their school profile, saving via a mutation hook with simple validation and feedback.",
  "frontend/src/components/admin/MonitoringTable.tsx": "Displays ranked daily reports in a sortable table with score badges and a detail view, loading skeletons, and report selection handling.",
  "frontend/src/components/admin/ReportDetailView.tsx": "Dialog showing a detailed breakdown of a principal's daily report, including photo, category scores, and formatted date.",
  "frontend/src/components/AppHeader.tsx": "Header component with logo, title, optional actions, and logout functionality clearing React Query cache.",
  "frontend/src/components/kepsek/AttendancePhotoField.tsx": "Handles image selection, validation, preview, and upload‑progress tracking for attendance photos, emitting an ExternalBlob to the parent.",
  "frontend/src/components/kepsek/DailyReportForm.tsx": "Form component for creating or editing a daily report, handling score calculation, photo upload, and submission via mutation.",
  "frontend/src/components/kepsek/ProfileSetupDialog.tsx": "Dialog form for entering and saving school profile details using a saveSchool mutation.",
  "frontend/src/components/kepsek/TodaySubmissionSummary.tsx": "Displays today's submitted daily report with score breakdown, attendance photo, and an edit button.",
  "frontend/src/components/StatusPills.tsx": "Provides badge components for scoring, submission status, and category score display with color logic.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and manages the backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and related status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for roles, school data, and daily reports, using the actor to fetch and mutate backend state.",
  "frontend/src/index.css": "Tailwind CSS base/theme configuration defining light and dark color variables and utility layers.",
  "frontend/src/lib/utils.ts": "Utility function for merging Tailwind class names using clsx and twMerge.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Displays an access-denied message with a logout button that clears identity and cached queries.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with summary cards, analytics, active schools, and monitoring table.",
  "frontend/src/pages/AdminKepsekManagementPage.tsx": "Provides admin tools to register and manage principal profiles, including a form toggle.",
  "frontend/src/pages/KepsekDashboardPage.tsx": "Shows principal profile, today's report status, and a form for submitting daily reports if needed.",
  "frontend/src/pages/LoginPage.tsx": "Login screen allowing users to authenticate via Internet Identity with a styled UI card.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, containers, animations, and enabling plugins.",
  "project_state.json": "Defines the project’s versioned state for a web app tracking daily Kepsek performance, including architecture notes, known issues, and a list of implemented features. Contains role-based access, daily form requirements, admin dashboards, analytics, and UI styling features."
}