{
  "backend/main.mo": "Backend actor implementing access control, school/user profile management, and daily report storage with date‑keyed maps.",
  "feature_evidence.json": "Feature evidence metadata mapping features to frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind CSS setup defining base styles and custom CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx with app icon and root container.",
  "frontend/src/App.tsx": "Main React app routing users by role with login, admin, kepsek, and access‑denied flows plus theme and loading states.",
  "frontend/src/components/admin/ActiveSchoolsSection.tsx": "Displays a searchable, filterable list of active schools with loading, error, and edit actions.",
  "frontend/src/components/admin/AdminSummaryCards.tsx": "Shows summary cards for active school count and daily report submissions with loading states.",
  "frontend/src/components/admin/AnalyticsSection.tsx": "Generates trend and completion analytics from daily reports using charts, with loading placeholders.",
  "frontend/src/components/admin/DailyProgressIndicators.tsx": "Renders badges indicating which daily report categories are completed based on scores and attachments.",
  "frontend/src/components/admin/EditSchoolDialog.tsx": "Provides a dialog form to edit school details and submit updates to the backend.",
  "frontend/src/components/admin/KepsekProfileForm.tsx": "Form to register a principal with a new school profile, validating input and submitting to the backend.",
  "frontend/src/components/admin/MonitoringTable.tsx": "Displays daily monitoring rows sorted by submission and score, with selectable detail views for each principal.",
  "frontend/src/components/admin/ReportDetailView.tsx": "Shows detailed daily report data including photo, timestamps, category scores, and notes in a dialog.",
  "frontend/src/components/AppHeader.tsx": "Shared header displaying app branding and logout, clearing React Query cache on sign‑out.",
  "frontend/src/components/kepsek/AttendancePhotoField.tsx": "Handles image upload, validation, preview, and progress tracking for attendance photos.",
  "frontend/src/components/kepsek/DailyReportForm.tsx": "Form for creating or editing daily reports with photo, time fields, checkboxes, notes, and save handling.",
  "frontend/src/components/kepsek/ProfileSetupDialog.tsx": "Collects and saves initial school profile information including name, region, and principal.",
  "frontend/src/components/kepsek/TodaySubmissionSummary.tsx": "Displays a submitted daily report summary with photo, times, notes, and an option to edit.",
  "frontend/src/components/StatusPills.tsx": "Reusable badge components for scores, submission status, and category scoring with color‑coded styling.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor based on the logged-in identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking through a React provider.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks to fetch and mutate backend data such as roles, schools, and monitoring rows using the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and basic utility layers.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge Tailwind class names using clsx and twMerge.",
  "frontend/src/localization/dashboardId.ts": "Centralized Indonesian localization strings for admin and principal dashboards, including UI labels and messages.",
  "frontend/src/main.tsx": "App entry point configuring React Query and Internet Identity providers and rendering the main App component.",
  "frontend/src/pages/AccessDeniedPage.tsx": "UI page shown on permission errors with options to copy principal ID, retry role checks, and log out.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with date-based monitoring data, summary cards, analytics, active schools, and CSV report download.",
  "frontend/src/pages/AdminKepsekManagementPage.tsx": "Provides an interface for admins to register and manage school principal profiles with a form workflow.",
  "frontend/src/pages/KepsekDashboardPage.tsx": "Displays a Kepsek’s school profile, daily report form, and submitted report data with date selection and error handling.",
  "frontend/src/pages/LoginPage.tsx": "Presents a login screen using Internet Identity with branding, sign‑in button, and footer.",
  "frontend/src/utils/candidOption.ts": "Utilities for unwrapping Candid optional values and safely handling optional ExternalBlob fields.",
  "frontend/src/utils/dayKey.ts": "Provides helpers to compute normalized nanosecond day keys for date-based storage.",
  "frontend/src/utils/reportDownload.ts": "Generates and downloads admin monitoring reports as CSV, formatting fields and timestamps appropriately.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them to sessionStorage, retrieve them with fallback, and clear them from session state or the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, radii, animations, container settings, and enabling typography, container-queries, and animation plugins.",
  "project_state.json": "Defines current project state, including implemented features and pending requests for a school report/attendance system with date‑flexible editing and admin tools."
}