{
  "backend/main.mo": "Motoko canister managing user profiles, school data, access control, and daily performance reports with admin and user role checks.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining light and dark theme color tokens.",
  "frontend/index.html": "HTML entry point loading the React app and defining metadata and favicon.",
  "frontend/src/App.tsx": "Main React app component handling authentication, role-based routing, and admin view switching.",
  "frontend/src/components/admin/ActiveSchoolsSection.tsx": "Admin section listing active schools with search, filtering, edit dialog, and loading/error states.",
  "frontend/src/components/admin/AdminSummaryCards.tsx": "Displays two summary cards showing active school count and number of reports for a selected date, with loading states.",
  "frontend/src/components/admin/AnalyticsSection.tsx": "Generates completion and trend analytics from today’s reports and renders line and pie charts, with skeletons while loading.",
  "frontend/src/components/admin/DailyProgressIndicators.tsx": "Shows badges indicating completion status of various daily report categories based on scores and photo availability.",
  "frontend/src/components/admin/EditSchoolDialog.tsx": "Dialog form for editing a school’s profile, prefilled from SchoolSummary and saved using a mutation with validation and error handling.",
  "frontend/src/components/admin/KepsekProfileForm.tsx": "Form to register or update a principal’s school profile by submitting principal ID and school details, with validation and toast feedback.",
  "frontend/src/components/admin/MonitoringTable.tsx": "Fetches, sorts, and displays daily monitoring rows in a table with scores, status, and detail view selection, handling loading and empty states.",
  "frontend/src/components/admin/ReportDetailView.tsx": "Displays detailed daily report info in a dialog, including photos, times, scores, and notes for each category.",
  "frontend/src/components/AppHeader.tsx": "Header with branding, optional child actions, and logout that clears identity and query cache.",
  "frontend/src/components/kepsek/AttendancePhotoField.tsx": "Handles image file selection, validation, upload progress, and preview for attendance photos.",
  "frontend/src/components/kepsek/DailyReportForm.tsx": "Form for creating or editing a daily report with autosave, time conversion, photo upload, and multiple score categories.",
  "frontend/src/components/kepsek/ProfileSetupDialog.tsx": "Form dialog for entering and saving initial school profile details such as name, region, and principal.",
  "frontend/src/components/kepsek/TodaySubmissionSummary.tsx": "Shows a submitted daily report summary with photo, times, notes, and scores, and allows editing.",
  "frontend/src/components/StatusPills.tsx": "Reusable badge components showing score levels, submission status, and category scores with color coding.",
  "frontend/src/constants/branding.ts": "Provides centralized constants for application logos, icons, and alt text.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on user identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useDebouncedCallback.ts": "Provides a debounced callback hook that delays execution until after a specified timeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React context and provider with login, logout, state management, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for roles, schools, profiles, and related mutations using an ICP actor and identity.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base utility styles.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/localization/dashboardId.ts": "Contains centralized Indonesian localization strings for admin and kepsek dashboards.",
  "frontend/src/main.tsx": "Bootstraps the React app by wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Renders an access denied screen with principal ID display, logout, and retry role-check actions.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page showing monitoring data, reports download, analytics, school management, and summary sections.",
  "frontend/src/pages/AdminKepsekManagementPage.tsx": "Provides an admin interface to register and manage school principals, showing a form toggle to create a new school profile.",
  "frontend/src/pages/KepsekDashboardPage.tsx": "Renders the Kepsek dashboard with school data, daily report viewing/editing, date selection, and error/loading handling.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen allowing users to authenticate using Internet Identity.",
  "frontend/src/utils/candidOption.ts": "Utility helpers for unwrapping Candid optional values and working with optional ExternalBlob URLs.",
  "frontend/src/utils/dayKey.ts": "Provides timezone-safe helpers for converting dates to day-key nanoseconds and formatting/parsing date inputs.",
  "frontend/src/utils/reportDownload.ts": "Generates and downloads daily monitoring data as a CSV file, formatting values and timestamps appropriately.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended color palette, custom animations, and plugin usage.",
  "project_state.json": "Project state metadata listing issues and pending feature requests focused on updating branding assets and applying new logos across the app."
}