{
  "backend/main.mo": "Defines school and daily report data models, manages storage, and exposes admin- and user-restricted APIs for saving and retrieving schools and daily reports.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files describing their roles in routing, UI components, hooks, and styling.",
  "frontend/index.css": "Defines Tailwind layers and OKLCH-based color variables for light and dark themes along with global base styling.",
  "frontend/index.html": "HTML entrypoint that sets metadata, favicon, and loads the main React script.",
  "frontend/src/App.tsx": "Main React component handling authentication, role-based routing, and switching between admin and Kepsek dashboards.",
  "frontend/src/components/admin/ActiveSchoolsSection.tsx": "Admin UI section that fetches, filters, and displays a searchable table of active schools with loading and error states.",
  "frontend/src/components/admin/AdminSummaryCards.tsx": "Displays cards showing active school count and today's report submissions using query hooks with loading skeletons.",
  "frontend/src/components/admin/AnalyticsSection.tsx": "Generates 7‑day trend and completion analytics from today's reports and visualizes them with Recharts, including loading fallbacks.",
  "frontend/src/components/admin/KepsekProfileForm.tsx": "Form for creating or editing a school profile with validation and submission via saveSchool mutation.",
  "frontend/src/components/admin/MonitoringTable.tsx": "Shows a ranked table of today’s reports with score badges and detail view modal, sortable by total score.",
  "frontend/src/components/admin/ReportDetailView.tsx": "Modal dialog showing detailed daily report info including photo, score breakdown, and date.",
  "frontend/src/components/AppHeader.tsx": "Header component displaying the app title, logo, and a logout button that clears identity and query cache.",
  "frontend/src/components/kepsek/AttendancePhotoField.tsx": "Handles attendance photo upload with validation, preview, progress tracking, and removal.",
  "frontend/src/components/kepsek/DailyReportForm.tsx": "Form for submitting a daily report, computing scores from inputs and saving via mutation with validation.",
  "frontend/src/components/kepsek/ProfileSetupDialog.tsx": "Form dialog for school principals to enter and save school profile details using saveSchool mutation.",
  "frontend/src/components/kepsek/TodaySubmissionSummary.tsx": "Displays today's submitted daily report with score breakdown, attendance photo, and edit option.",
  "frontend/src/components/StatusPills.tsx": "Provides badge components that display score values and submission status with color-coded visual indicators.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and logout logic.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for roles, schools, and daily reports using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes with blue‑green palette.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind‑merge for class name merging.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Shows an access denied message with logout functionality clearing identity and queries.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page displaying summary cards, analytics, active schools, and monitoring table.",
  "frontend/src/pages/AdminKepsekManagementPage.tsx": "Admin page for registering and managing principal school profiles, displaying instructions and toggling a form for profile creation.",
  "frontend/src/pages/KepsekDashboardPage.tsx": "Principal dashboard showing school profile data, today's submission status, and access to the daily report form or summary.",
  "frontend/src/pages/LoginPage.tsx": "Login screen allowing users to authenticate via Internet Identity with a styled card layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing them in session storage, and managing persisted values across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, themes, animations, and plugins for the app’s UI.",
  "project_state.json": "Project state file describing app purpose, architecture notes, features, and versioning metadata."
}