{
  "kind": "build_request",
  "title": "Allow central admin to edit schools from the admin schools list",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Add an admin-only backend API that allows a central admin to update a School record for an arbitrary principal (i.e., edit a school entry from the admin school list without being the school owner). The API must accept (principal: Principal, school: School) and persist the school under the provided principal key.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "update, daftar sekolahnya bisa di edit oleh admin pusat"
        ]
      },
      "acceptanceCriteria": [
        "Calling the new API as a non-admin traps/returns an authorization error.",
        "Calling the new API as an admin updates the school data stored under the provided principal (not under the caller).",
        "After updating a school to active=false, that school no longer appears in getActiveSchoolsList().",
        "No new backend actors/services are introduced; changes remain within backend/main.mo (single-actor architecture)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Add a frontend edit flow in the Admin \"Active Schools\" table so an admin can edit school fields (School Name, Region, Principal Name, Active status) for a selected row and save changes back to the backend for that row’s Principal ID.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "update, daftar sekolahnya bisa di edit oleh admin pusat"
        ]
      },
      "acceptanceCriteria": [
        "Each school row in the Active Schools table provides an Edit action.",
        "Clicking Edit opens a dialog/modal with a form prefilled with the selected school’s current values (including Active status).",
        "Submitting the form calls the new admin-only backend API with the selected row’s Principal ID and the edited School object.",
        "On successful save, the Active Schools list refreshes (React Query invalidation/refetch) and reflects the edited values.",
        "If Active is toggled off and saved, the edited school disappears from the Active Schools list after refresh (because the list is active-only).",
        "If the save fails due to authorization, show a clear error message in English indicating the user lacks permission."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Extend the React Query layer to support updating a school for a specific principal from the admin UI, including cache invalidation for active schools list and active schools count.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "update, daftar sekolahnya bisa di edit oleh admin pusat"
        ]
      },
      "acceptanceCriteria": [
        "A new mutation hook exists for admin school updates by principal ID.",
        "On success, the mutation invalidates/refetches at minimum: ['activeSchoolsList'] and ['activeSchoolsCount'] so the admin dashboard reflects the latest state.",
        "The existing useSaveSchool() behavior remains unchanged for its current callers (no regressions to Kepsek profile setup or admin create flows)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor; implement changes in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Building a separate 'All مدارس/All schools (including inactive)' admin page or backend query unless required to complete editing from the existing Active Schools list.",
    "Adding third-party integrations, external databases, or non-Internet-Computer auth.",
    "Implementing bulk edit/import/export for schools."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}