{
  "kind": "build_request",
  "title": "Admin: Display list of active schools",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Add an admin-only backend query to return a list of schools filtered to only those with active=true, including enough data to display each school in a UI list (school name, region, principal name, and the Kepsek/Principal ID).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "update, berikan daftar sekolah yang sudah aktif"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a new query method that returns an array of active schools.",
        "Each returned entry includes: school.name, school.region, school.principalName, school.active, and the associated Principal (Kepsek) ID.",
        "Calling the method as a non-admin traps/returns an authorization error consistent with existing admin-only queries.",
        "The existing getActiveSchoolsCount behavior is unchanged and continues to work."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add a React Query hook to fetch the active schools list from the backend and cache it under a stable query key, with loading and error states exposed to the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "update, berikan daftar sekolah yang sudah aktif"
        ]
      },
      "acceptanceCriteria": [
        "A new hook exists in frontend/src/hooks/useQueries.ts to fetch the active schools list.",
        "The hook is disabled until the backend actor is available (consistent with existing hooks).",
        "On error (e.g., unauthorized), the hook surfaces an Error object that the UI can render as a friendly message.",
        "The hook returns an empty list (not undefined) in the UI rendering path when there is no data yet."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Update the Admin UI to display a dedicated \"Active Schools\" section showing a table/list of all active schools with: School Name, Region, Principal Name, and Principal ID, including a client-side search filter (by school name/region/principal name) and a count of results.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "update, berikan daftar sekolah yang sudah aktif"
        ]
      },
      "acceptanceCriteria": [
        "Admin users can see an \"Active Schools\" section in the admin experience (dashboard or management page) without navigating away from the admin area.",
        "The section renders a table/list with columns: School Name, Region, Principal Name, Principal ID.",
        "A search input filters the displayed rows in real time (case-insensitive) against name/region/principalName.",
        "The UI shows a loading skeleton/spinner while fetching and a clear empty state when there are zero active schools.",
        "All user-facing text added/updated by this change is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Only create backend/migration.mo if a stable-state upgrade is required by the change (conditional migration policy).",
    "Do not edit files under frontend/src/components/ui or other immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use React + TypeScript + Tailwind + React Query patterns consistent with the existing codebase."
  ],
  "nonGoals": [
    "Changing how schools are created/edited (beyond what is necessary to read and list active schools).",
    "Implementing real-time updates via websockets/push; periodic refetch is acceptable.",
    "Adding third-party integrations or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}