{
  "kind": "build_request",
  "title": "Fix Admin Monitoring daily progress indicators not showing for any date",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Fix the Admin Monitoring table so that the per-report daily progress indicators (Attendance, Class Control, Teacher Control, Parent/Guardian Response, Program & Problem Solving) reliably render for every returned report for any selected date.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "progres harian kepsek di tabel admin\nsemua tanggal\ntidak ada \n\nkerjakan sekarang"
        ]
      },
      "acceptanceCriteria": [
        "When the Admin Monitoring table shows at least one report row, the 'Daily Progress' cell in each row visibly renders five category indicators (not blank) for the selected date.",
        "Daily progress indicators render consistently across all selected dates (today and historical dates) as long as `useGetReportsForDate(selectedDate)` returns data.",
        "Daily progress indicator logic correctly interprets optional Candid fields (e.g., `attendancePhoto` as an opt value) so it does not mis-detect presence/absence due to JavaScript truthiness (e.g., `[]` vs `[value]`)."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Update the completion logic used by the Admin daily progress indicators so that it matches the actual stored DailyReport data and does not depend on fragile equality checks (e.g., `score === 20`), ensuring categories display as completed when the corresponding section is filled according to the report data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "progres harian kepsek di tabel admin\nsemua tanggal\ntidak ada"
        ]
      },
      "acceptanceCriteria": [
        "For each category, the indicator is marked completed based on robust checks against the DailyReport fields (e.g., score > 0 and/or required data present), and not only `score === 20`.",
        "Attendance completion correctly requires a real photo value (opt Some) rather than passing on an empty opt (None).",
        "No runtime errors occur in `DailyProgressIndicators` when any DailyReport field is missing/undefined/optional from the generated types."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Ensure any user-facing text that is added or modified while implementing this fix is in English (including Admin Monitoring table descriptions, empty states, button labels, and status badges if touched).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request."
        ]
      },
      "acceptanceCriteria": [
        "Any edited strings in `frontend/src/components/admin/MonitoringTable.tsx`, `frontend/src/components/admin/DailyProgressIndicators.tsx`, and/or related components are in English.",
        "If the empty state is shown (no reports for selected date), the message is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Maintain the existing single-actor backend architecture (all Motoko logic in backend/main.mo)."
  ],
  "nonGoals": [
    "Do not introduce new report categories or change scoring weights.",
    "Do not add new authentication methods or roles.",
    "Do not change backend persistence or the DailyReport schema as part of this fix unless it is strictly required to make progress indicators render."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}