{
  "kind": "build_request",
  "title": "Reduce friction for principals by auto-assigning Kepsek role and improving Access Denied onboarding",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend so that when an admin registers or updates a school profile for a principal, the target principal is automatically granted the Kepsek/user role (so they no longer see “Access Denied” after logging in).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "perbaiki, ini lumayan meribetkan"
        ]
      },
      "acceptanceCriteria": [
        "After an admin calls the existing school-registration flow for a principal (the same one used by the UI), that principal’s subsequent call to getCallerUserRole returns the Kepsek/user role (not guest).",
        "A principal who has been registered by an admin can log in and reach the Kepsek dashboard without being blocked by the AccessDeniedPage role check.",
        "No new backend canisters/services are introduced; all logic remains in the single main actor."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve the guest/no-role experience so it is not cumbersome: on the Access Denied screen, show the logged-in user’s Principal ID with a one-click “Copy” action, provide clear next-step instructions, and add a “Retry” action that refetches the caller role without requiring the user to sign out.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "perbaiki, ini lumayan meribetkan"
        ]
      },
      "acceptanceCriteria": [
        "When a logged-in user has role=guest or no role, the Access Denied view displays their Principal ID in a read-only field and includes a Copy button that confirms success via toast.",
        "The Access Denied view includes a Retry button that triggers a role refetch and, if the role becomes valid, routes the user into the correct dashboard without logout.",
        "All user-facing text added/changed in this flow is in English."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove the extra manual step implied in the admin UI: update the Admin “Manage School Principals” page and the Kepsek registration form so the instructions and labels are in English and reflect that saving a school profile will also assign the Kepsek/user role automatically.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "perbaiki, ini lumayan meribetkan"
        ]
      },
      "acceptanceCriteria": [
        "AdminKepsekManagementPage no longer instructs admins to separately “assign the user role via backend”; it states that registering the school profile will assign access automatically.",
        "KepsekProfileForm field labels and helper text are in English (e.g., “Principal ID”, not mixed-language labels).",
        "Successful registration messaging remains clear and in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; do not introduce additional backend services.",
    "Do not modify files under frontend/src/components/ui or other paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text in these changes."
  ],
  "nonGoals": [
    "Implementing third-party authentication beyond Internet Identity.",
    "Adding real-time features (WebSockets/chat/notifications).",
    "Redesigning unrelated dashboard features (analytics, monitoring table behavior) beyond the role/onboarding friction shown."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}