{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin: Edit schools from Active Schools list",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Add an edit action per row in the Admin Active Schools table that opens a prefilled modal form and saves changes for the selected school’s principal.",
      "acceptanceCriteria": [
        "Each school row in the Active Schools table provides an Edit action.",
        "Clicking Edit opens a dialog/modal with a form prefilled with the selected school’s current values (including Active status).",
        "Submitting the form calls the new admin-only backend API with the selected row’s Principal ID and the edited School object.",
        "On successful save, the Active Schools list refreshes (React Query invalidation/refetch) and reflects the edited values.",
        "If Active is toggled off and saved, the edited school disappears from the Active Schools list after refresh (because the list is active-only).",
        "If the save fails due to authorization, show a clear error message in English indicating the user lacks permission."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/EditSchoolDialog.tsx",
          "operation": "create",
          "description": "Create an admin-only edit dialog component (modal) that renders a form for School Name, Region, Principal Name, and Active status; prefill values from the selected SchoolSummary row and submit via the new React Query mutation. Use existing shadcn-ui dialog/form building blocks by importing from the read-only ui components (do not modify them). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/ActiveSchoolsSection.tsx",
          "operation": "modify",
          "description": "Add an Actions column with an Edit button per row; wire the button to open the new EditSchoolDialog with the selected row’s principal text and current School values. On save success, close the dialog and rely on React Query invalidation/refetch to refresh the table; on authorization failure, surface an English error message indicating lack of permission. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Extend React Query hooks to support admin updating a school for a specified principal and invalidate active schools list/count caches on success without changing existing saveSchool callers.",
      "acceptanceCriteria": [
        "A new mutation hook exists for admin school updates by principal ID.",
        "On success, the mutation invalidates/refetches at minimum: ['activeSchoolsList'] and ['activeSchoolsCount'] so the admin dashboard reflects the latest state.",
        "The existing useSaveSchool() behavior remains unchanged for its current callers (no regressions to Kepsek profile setup or admin create flows)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook for admin updates that calls the backend capability to save a School for an arbitrary principal (parse principal from the selected row’s Principal ID string as needed) and on success invalidates ['activeSchoolsList'] and ['activeSchoolsCount']; keep existing useSaveSchool() unchanged."
        }
      ]
    }
  ]
}