{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Auto-assign role messaging and smoother Access Denied onboarding for principals",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Enhance Access Denied onboarding for guest/no-role users with Principal ID copy, clear instructions, and a Retry role refetch action.",
      "acceptanceCriteria": [
        "When a logged-in user has role=guest or no role, the Access Denied view displays their Principal ID in a read-only field and includes a Copy button that confirms success via toast.",
        "The Access Denied view includes a Retry button that triggers a role refetch and, if the role becomes valid, routes the user into the correct dashboard without logout.",
        "All user-facing text added/changed in this flow is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AccessDeniedPage.tsx",
          "operation": "modify",
          "description": "Update the Access Denied view UI to: (1) display the logged-in user's Principal ID (read-only) using Internet Identity, (2) add a one-click Copy action that uses the existing toast system to confirm success, (3) add clear next-step instructions in English for contacting an admin and sharing the Principal ID, and (4) add a Retry button that triggers a role refetch without logging out. Use existing shadcn/ui components already imported in the project for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a small helper hook or exported utility to force-refresh the cached caller role (e.g., via React Query's queryClient refetch/invalidate for the caller role query key), so the Access Denied screen can reliably retry without requiring logout and without changing backend behavior."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the improved AccessDeniedPage behavior into the app's role-based routing: ensure the role query can be retried from the Access Denied state and that a successful role refetch causes the app to render the correct dashboard automatically (admin or user) without a sign-out."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update admin management copy and Kepsek registration form labels/instructions to English and reflect automatic role assignment upon saving a school profile.",
      "acceptanceCriteria": [
        "AdminKepsekManagementPage no longer instructs admins to separately “assign the user role via backend”; it states that registering the school profile will assign access automatically.",
        "KepsekProfileForm field labels and helper text are in English (e.g., “Principal ID”, not mixed-language labels).",
        "Successful registration messaging remains clear and in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminKepsekManagementPage.tsx",
          "operation": "modify",
          "description": "Replace the current instructional alert text with English guidance that reflects the new behavior: admins should only collect the principal's Principal ID (after they log in once) and saving the school profile will automatically grant Kepsek/user access—remove any mention of manually assigning roles. Keep UI structure intact using existing shadcn/ui components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/KepsekProfileForm.tsx",
          "operation": "modify",
          "description": "Update KepsekProfileForm labels, placeholders, helper text, and validation/toast messages to be fully English and to explicitly state that saving the school profile will also grant Kepsek/user access automatically. Ensure the success toast remains clear and in English. Use existing shadcn/ui form components as currently used; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}