{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Dashboard kepala sekolah: perbaikan alur update/simpan laporan harian per hari dan sinkronisasi otomatis ke dashboard admin/manajemen.",
  "architectural_notes": [
    "Laporan harian kepala sekolah disimpan per hari (1 laporan per tanggal) dan dapat di-update untuk tanggal berjalan.",
    "Saat tombol simpan ditekan: data disimpan sementara; ketika hari berganti, laporan hari sebelumnya menjadi kosong untuk digantikan laporan hari berikutnya (reset/rollover).",
    "Perubahan laporan harian kepala sekolah harus otomatis tersinkron ke data/dashboard admin/manajemen.",
    "Field yang harus terupdate: absensi harian (jam datang, jam pulang) + foto, kontrol kelas, kontrol guru, respon wali santri, program, problem solving."
  ],
  "known_issues": [
    "Bug: di dashboard kepala sekolah, edit/update laporan harian tidak tersimpan; tampilan kembali ke data lama dan tidak sinkron ke dashboard admin."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-fix-the-principal-kepsek-daily-report-save-update-flow-so-edited-values-persist-and-immediately-appear-updated-in-the-kepsek-dashboard-for-the-selected-date-including-these-fields-daily-attendance-arrival-time-departure-time-attendance-photo-class-control-teacher-control-wali-santri-response-and-program-problem-solving",
      "title": "Fix the principal (Kepsek) daily report save/update flow so edited values persist and immediately appear updated in the Kepsek dashboard for the selected date, including these fields: daily attendance (arrival time, departure time) + attendance photo, class control, teacher control, wali santri response, and program/problem solving.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-daily-report-is-stored-and-edited-strictly-per-day-the-system-must-load-the-report-for-the-selected-calendar-day-overwrite-the-existing-report-for-that-same-day-when-saving-again-and-show-an-empty-new-report-form-for-a-day-that-has-no-saved-report-so-a-new-day-does-not-prefill-yesterday-s-data",
      "title": "Ensure the daily report is stored and edited strictly per day: the system must load the report for the selected calendar day, overwrite the existing report for that same day when saving again, and show an empty/new report form for a day that has no saved report (so a new day does not prefill yesterday’s data).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-after-a-kepsek-saves-a-daily-report-ensure-admin-management-views-reflect-the-update-for-that-date-by-invalidating-refetching-the-relevant-admin-monitoring-queries-so-the-updated-report-appears-in-admin-dashboards-for-the-same-day",
      "title": "After a Kepsek saves a daily report, ensure admin/management views reflect the update for that date by invalidating/refetching the relevant admin monitoring queries so the updated report appears in admin dashboards for the same day.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Perbaiki bug: update & simpan laporan harian kepala sekolah tidak tersimpan/terupdate dan tidak sinkron ke dashboard admin/manajemen",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Implementasi alur laporan harian per hari: edit/update per hari, simpan sementara, dan reset untuk hari berikutnya",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "projectName": "School Daily Reports",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}